## Final Project Submission

Please fill out:
* Student name: Henry Kemboi
* Student pace: full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [15]:
# Your code here - remember to use markdown cells for comments as well!
import sqlite3
import pandas as pd
conn = sqlite3.connect(".\data\im.db")

In [16]:
# Know the table names in the database
table_name_query = """SELECT name 
                      AS 'Table Names' 
                      FROM sqlite_master 
                      WHERE type='table';"""

pd.read_sql(table_name_query, conn)

     Table Names
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [21]:
df = pd.read_sql("""SELECT * FROM directors;""", conn)
df.head(10)

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502
5  tt0878654  nm2291498
6  tt0878654  nm2292011
7  tt0879859  nm2416460
8  tt0996958  nm2286991
9  tt0996958  nm2286991

In [ ]:
#Another try at this Git push thing being directed by our able tutor Henry